# SetLayerCutPlane

## Description
Sets the cut plane of the layer.

```pascal
PROCEDURE SetLayerCutPlane(
				layer    : HANDLE;
				cutPlane : REAL (Coordinate));
```

```python
def vs.SetLayerCutPlane(layer, cutPlane):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|layer|HANDLE|The layer.|
|cutPlane|REAL (Coordinate)|The cut plane.|

## See Also
VS Functions:
GetLayerCutPlane

## Version
Availability: from Vectorworks 2017

## Category
* Layers